{
    "profile": "Princess Celestia is an Alicorn and the Princess of the Sun. She has pale magenta eyes, a coat that is a light fuchsiaish gray, and a mane with light cerulean, light turquoise, very light cobalt blue, and pale heliotrope streaks. She is the adoptive aunt of Princess Cadance, the younger sister of Princess Luna, and the former teacher of Twilight Sparkle and Sunset Shimmer. She is sometimes addressed as Queen Celestia.\n\nPrincess Celestia's occupation history includes being Twilight Sparkle's teacher and the co-ruler of Equestria. She has a number of nicknames including Princess Celest and Celie. Her residence has been listed as Maretime Manor, Canterlot, the Castle of the Two Sisters, and Skyros. She is often very kind. She is also related to Shining Armor, Spike, and Prince Blueblood.",
    "quotes": [
        "I told you that you needed to make some friends, nothing more. I saw the signs of Nightmare Moon's return, and I knew it was you who had the magic inside to defeat her, but you could not unleash it until you let true friendship into your heart.",
        "Spike, take a note please. I, Princess Celestia, hereby decree that the unicorn Twilight Sparkle shall take on a new mission for Equestria. She must continue to study the magic of friendship. She must report to me her findings from her new home in Ponyville.'",
        "You are a wonderful student, Twilight. I don't have to get a letter every week to know that.",
        "My most faithful student, Twilight Sparkle, has done many extraordinary things since she's lived in Ponyville. She even helped reunite me with my sister Princess Luna. But today, Twilight Sparkle did something extraordinary. She created new magic, proving without a doubt that she is ready to be crowned Equestria's newest princess.",
        "When I sent you to Ponyville, I had high hopes. When you became Princess of Friendship, I knew I made the right choice. But nothing could prepare me for how proud I am right now. Equestria is definitely in the right hooves. You are ready."
    ]
}