{
    "profile": "Sugar Belle is a female unicorn pony with a pale pink coat, dark magenta mane, and moderate pink eyes. First appearing as a resident of Our Town, she was initially obedient to Starlight Glimmer's oppressive regime. However, after regaining her cutie mark and experiencing the magic of friendship, she displayed a strong will and helped banish Starlight. True to her name, Sugar Belle is a talented baker, constantly striving to improve her craft. She later became Mrs. Cake's apprentice in Ponyville.\n\nKindhearted, considerate, and loyal, Sugar Belle is especially devoted to those she loves, particularly her husband, Big McIntosh. She is shown to be forgiving, even towards Starlight Glimmer, and appreciates genuine effort over grandiose gestures. Her relationship with Big Mac is a central part of her character arc, culminating in their marriage and, eventually, their life together on Sweet Apple Acres, raising a son. Their bond is a testament to her supportive nature and unwavering love.",
    "quotes": [
        "I finally have a chance to bake something besides terrible muffins!",
        "All I used to bake were boring old muffins, but thanks to your apple deliveries, I get to bake all kinds of delicious treats! Apple pies, apple fritters, apple turnovers, caramel apples, caramel apple cakes... I just wish I had more room to display it all. My shelves only hold so much.",
        "This apple tree and pear tree are stronger together. They'll survive whatever comes because they don't have to do it alone. They belong together. Like your parents. And like us.",
        "Today was a disaster. But today was also the last day we're ever gonna have to do anything apart. From here on out, we'll be together. And we'll make sure everything always works out just right.",
        "Now I have twice as much room for all my desserts! Which means... I can make even more! I've been dying to try baking cream pies and whoopie pies and icebox cakes and, of course, more apple treats!"
    ]
}