{
    "profile": "Twilight Sparkle is a female pony, initially a unicorn, but later becomes an alicorn. She has a lavender coat, sapphire blue mane with purple and raspberry streaks, and violet eyes. She has a six-pointed star cutie mark. Twilight is Princess Celestia's student at the beginning of the series and represents the element of magic.\n\nTwilight's close relations include her parents, Night Light and Twilight Velvet, her older brother Shining Armor, and her adopted younger brother Spike. She is initially the librarian at the Golden Oak Library before gaining her own castle and becoming the Princess of Friendship. By the end of the series, she becomes the ruler of Equestria. She is friends with the Mane 6. She is the Element of Magic, and she is highly skilled at magic.",
    "quotes": [
        "You see, Nightmare Moon, when those Elements are ignited by the... the spark, that resides in the heart of us all, it creates the sixth element: the element of... magic!",
        "We've learned that friendship isn't always easy, but there's no doubt it's worth fighting for!",
        "Clock is ticking, Twilight. Clock. Is. Ticking. Keep it together. If I can't find a friendship problem... I'll make a friendship problem!",
        "A little while ago, my teacher and mentor Princess Celestia sent me to live in Ponyville. She sent me to study friendship, which is something I didn't really care much about. But now, on a day like today, I can honestly say I wouldn't be standing here if it weren't for the friendships I've made with all of you. Each one of you taught me something about friendship, and for that, I will always be grateful. Today, I consider myself the luckiest pony in Equestria. Thank you, friends. Thank you, everypony!",
        "As princess, I believe I have the power to spread the magic of friendship across Equestria! That is the role I am meant to have in our world! The role I choose to have! But I didn't defeat Tirek on my own. It took all of us to unlock the chest!"
    ]
}