[{"title": "Scootaloo's Best Day Ever", "url": "https://www.fimfiction.net/story/352835/scootaloos-best-day-ever", "id": "352835", "author": "The wandering commenter", "author_url": "https://www.fimfiction.net/user/176221/The+wandering+commenter", "tags": ["Rainbow Dash", "Pinkie", "OC", "CMCs"], "text": "> Scootaloo's Best Day Ever\r\n>  by The wandering commenter\r\n> --------------------------------------------------------------------------\r\n\r\n> A really fun day.\r\n> --------------------------------------------------------------------------\r\n\r\n\"Good morning, my little silly filly!\" A familiar voice said while opening the blinds. \r\n\r\n\"Mmm....Good morning, my big doofy daddy.\" Scootaloo said while slowly wakening up with a smile. Scootaloo's father smiled at her little goofball and gave her a quick belly rub. \"Hahaha! Quit it dad!\" Scootaloo said with a smile. \r\n\r\n\r\n\r\n\"Hmmm....ok fine.\"Scootaloo's dad said. \"We got chocolate pancakes for breakfast today, with a glass of chocolate milk. I know there your favorite.\" Scootaloo gasped and got ready for her day as fast as she could, all her dad could see was a purple and orange blur running around. \r\n\r\n\r\n\r\n\"I'm ready for breakfast dad!\" Scootaloo said with a mouth full of toothpaste foam.\r\n\r\n\r\n\r\n\r\n\r\nIn the dining room, a stack of five chocolate pancakes and a big glass of chocolate milk with a silly straw was quickly devoured by the young Pegasus. \"Well, someone is hungry pony.\" Scootaloo's mother said with a smile.\r\n\r\n\r\n\"Yep!\" said a still chewing on a pancake Scootaloo. \"I got a big day of hanging out with Sweetie Belle and Apple Bloom today so I need my strength.\" \r\n\r\n\r\n\r\nAs she was saying this a knock came at the door. Scootaloo opened the door and sure enough, it was her best friends Sweetie Belle and Apple Bloom. \"Hey Scoots!\" exclaimed Sweetie Belle. \r\n\r\n\r\n\"Hi guys!\" replied Scootaloo. \"Mom, may I go hang out with my friends?\" Asked Scootaloo.  \r\n\r\n\r\n\"Yes, just be back by five o'clock.\" Scootaloo's mother responded with a smile. \"And remember, have fun!\"\r\n\r\n\r\nAnd soon enough, Scootaloo's day with her best friends had started. \"Wind Dancer, honey how did we ever raise such a beautiful daughter?\"  \r\n\r\n\r\n\r\n\r\n\"I don't know Land Rusher. But I'm thankful we have her.\" said Wind Dancer as she hugged her husband.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nScootaloo's day with her best friends was going well. They skipped rope, swam in the swimming hole, and hanged out in the arcade. \r\nWhile they were in the arcade, Sweetie Bell got enough tickets to buy three small teddybears for the three of them.\r\nSoon enough, it was time for lunch. \"Man I'm hungry!\" exclaimed Scootaloo. \r\n\r\n\"Didn't you have a big breakfast this morning Scoots?\" inquired Apple Bloom.\r\n\r\n\r\n\"Yeah but it's been a long four hours.\" responded Scootaloo. \r\n\r\n\"I can help!\" Said Pinkie Pie as she hoped by the silly filly trio. \"I have this cake that I made for myself, but I'm full from the ten other cakes I smashed on my face already.\" Pinkie Pie rapidly said and continued. \"So, I'm giving it to the first pony that can eat it is the most awesome way possible!\" \r\n\r\n\r\n\"And that would be?\" asked a quizzical Scootaloo. \r\n\r\n\"I'm glad you asked! Follow me!\" answered the pink maned pony.\r\n\r\n\r\n\r\nA short walk later, they find a big three-layered vanilla cake and standing near it, Pinkie's Party Cannon which was also pointed at the cake.\r\n\"Ah, Pinkie, why is your party cannon pointed at the cake?\" asked Sweetie Belle.\r\n\r\n\r\nPinkie responded with, \"Well, I was asking Dashie 'what would be the most awesome way of eating a cake'  and she said 'By eating it after being shot out of a catapult!' but I couldn't find a catapult so I'm using my party cannon instead!\". \"So, Scootaloo do you want to eat a cake this way?\" questioned the Party Pony. \r\n\r\nBut Scootaloo, ever the adventurous one, was already in the party cannon. \"Fire me when ready Pinkie!\" declared Scootaloo. \r\n\r\n\"Ok but first we need to get a helmet on that head!\" Said Pinkie Pie. \r\n\r\n\r\n\r\nAfter getting Scootaloo's scooting helmet and putting it on, she was fired out of the cannon and into the cake. Scootaloo's front hooves and head stood out of the cake as she began eating it. Her back hooves were sticking out and wiggling out the entry point. The rest of the Cutie Mark Crusaders and the hyper party pony where covered with pieces of cake and vanilla frosting.  They all had a good laugh about it.\r\n\r\n\r\n\r\n\r\n\r\nA little while later, a still vanilla frosting smelling Scootaloo and the rest of the CMC where wandering around Ponyville when suddenly Rainbow Dash dropped by for a visit.\r\n\r\n\"Hey squirt!\" Greeted Rainbow Dash giving her biggest fan and her sort of sister a gentle noogie. \r\n\r\n\r\n\"Hey Dash!\" reciprocated Scootaloo. \r\n\r\n\r\n\"Hey squirt, me and the Wonderbolts were talking and...\"\r\n\r\n\r\n\"And what?\" Asked an excited Scootaloo. \r\n\r\n\r\n\"Well, we want to give you this.\" Rainbow dash gave her an official Wonderbolts uniform with her name on it. Scootaloo had tears of joy in her eyes as she hugged Rainbow Dash. \"Heh, your welcome squirt.\" The mood was changed when Rainbow Dash said \"Umm squirt, why do you smell like vanilla frosting?\"\r\n\r\n\r\n\r\nShe responded, \"Long story.\" with an embarrassed smile. \r\n\r\n\r\n\r\n\r\n\r\nAs it was coming up to five o'clock the trio and Rainbow Dash went back to Scootaloo's house. Scootaloo, after a quick swim was no longer smelling of vanilla frosting and had her uniform on. Her parents welcomed her back home as she said good-bye to her friends and almost sister and had a big group hug as dinner of hay burgers and milk shakes was being served. Scootaloo told her parents about her day and they loved every bit of it. She was tucked into bed with kiss from her mommy on the forehead and a smile on her face. In her hooves, the small teddy bear that Sweetie Belle won and in her dresser, her wonderbolts uniform.  \r\n"}, {"title": "A Timberwolf Lullaby", "url": "https://www.fimfiction.net/story/363988/a-timberwolf-lullaby", "id": "363988", "author": "Comrade Bagel Muffin", "author_url": "https://www.fimfiction.net/user/269744/Comrade+Bagel+Muffin", "tags": ["Timberwolves"], "text": "> A Timberwolf Lullaby\r\n>  by Comrade Bagel Muffin\r\n> --------------------------------------------------------------------------\r\n\r\n> Bed Time\r\n> --------------------------------------------------------------------------\r\n\r\nEleven Timberwolf pups all well behaved. Danced and played in the pack's cave. The sun has gone down and in the Everfree. Eleven little Timberwolf pups play under the cloudy night sea. They jump and bounce and run around. They sing and howl and roll on the ground. They play and play with absolutely no fear; for nothing can hurt them when mommy is near. They tumble and roll on the cave floor. They howl and then yawn, and play some more. Mommy stands up, and calls them nigh. So  they dance and hop up to mommy's side.\r\n\"Oh mommy,\" one began. \"Do you want to play with me?\"\r\n\"Oh yes play. We can swim in the lake or climb up a tree.\"\r\n\"No my little pups the night has begun. It's time for sleeping until tomorrow's sun.\" She grabbed her little puppies and pulled them all up close. It was the last part of the day, and of it she'd make the most. \"And in your dreams I will play with all of you. Through fields of Zap Apples we'll run through. And should you have bad dreams know your mommy is here. There is nothing in this world that my precious puppies need fear.\"\r\n\"But mommy I'm not tired not at all.\"\r\n\"Yes I can stay up till the moon starts to fall.\"\r\n\"Can't I play in the woods with the pack; see I'm so big and tall.\"\r\n\"See mommy the moon isn't even high.\"\r\n\"It's just barely on the edge of the sky.\"\r\n\"Now my little puppies,\" Mommy said with a smile. \"Why don't you lay down with Mommy a while.\" And she lay down with her pups all about. She smiled and said before any could pout. \"And once I have begun my rest, you all may dance, play, and fest. For Mommy just want's to lay with her little ones, and fall asleep surrounded by her precious daughters and sons.\"\r\n\"Mommy can we play tomorrow?\" one asked with a yawn\r\n\"We can play all day; we'll start at the break of dawn.\"\r\n\"Mommy listen to my song.\" She howled and the others joined along. The song was quick and did not last long. Mommy smiled as she listened to her little throng.\r\n\"That was very nice my little pups. Now I will sing for you my little loves.\" She began to sing and it echoed in the cave. Everfree was filled with the song that she gave. Up in the cloudy sky. Up with the moon and the stars so high, The whole of heavens and earth were filled with a mommy's lullaby.\r\n\r\nSleep now in Mommy's embrace.\r\nSee now Mommy's face.\r\nSleep and know that you are safe.\r\nAs you sleep in your mommy's embrace.\r\n\r\nThe pups all let out soft yawns, as their mommy continued her gentle song. As the clouds softly rolled up in the moon lit seas. Mommy continued to sing. That they would find rest and only the happiest of dreams.\r\n\r\nAnd as assuredly as the Zap Apples come.\r\nOne day you will blossom.\r\nSo sleep with me for tonight.\r\nUntil the sun comes with its light.\r\n\r\nThe little Timberwolf puppies snuggled up to their mommy. Knowing that there they were safe from jeopardy, and from all around the Forest Everfree the pack started to sing with their mommy. As one by one brothers and sisters started to sing. To the song the puppies own howls and yawns they did bring. Mommy smiled and howled too, and once the howling was finished she continued. To sing her lullaby. That her puppies could dream about prancing in the sky.\r\n\r\nAs assuredly as the Zap Apples appear.\r\nKnow that your mommy is always near,\r\nNothing exist to keep us apart.\r\nFor I am always with you and you're in my heart.\r\n\r\n\"Mommy,\" one little pup began with a yawn, \"what will we play when the night has gone.\"\r\n\"Can we climb trees and swim in the lake? And can we sing and dance once we awake?\"\r\n\"Or can we play in the Everfree; pretending to hunt mandicors and cockatrices?\"\r\n\"Or may we run through the blue flowers that cover the ground, and dance and play in them and run all around?\"\r\n\"Can we play big and strong and act like we're hunting all the night long?\"\r\n\"Or can we howl and fill the forest with our song?\" the last one finished with a big yawn.\r\n\"All of these things we can do and more. After all, loving and caring are what mommies are for. And I love and care for all my pups . All of you are precious.\" The moon had not even rose above the trees. Which waved back and forth in the early night breeze. And to help ease their long day out. She nuzzled and licked each pup that lay round about. Closing their eyes they drifted to sleep to prance in the skies or swim in lakes deep. And the last thing they heard before they said good-bye. Was their loving mother's lullaby.\r\n\r\nSleep my precious little ones.\r\nMy beloved daughters and sons.\r\nOne day you will be big and strong.\r\nAnd fill the night with your song.\r\nBut for now sleep in mommy's embrace.\r\nAnd know that here you are safe.\r\nIn your dreams I'll meet you there.\r\nIn orchards of Zap Apples ever fair.\r\nSo Sleep and dream and dream in peace.\r\nFor mommy loves you all.\r\n\r\nAnd with her puppies all safe and about her; she yawned closed her eyes. That she could join her babies up in the skies. Where surely they danced, played, howled, and pranced. And when the new day came with new unknown things. Her puppies would awake to all that the next day brings. The first thing that they'd see the first thing that they'd know. Is that their mommy is always about. Ready, able, and willing to dispel all fears, worries, and doubts. She closed her eyes and soft drifted away. Ready for the bight morning day.\r\n"}, {"title": "An October-December Romance", "url": "https://www.fimfiction.net/story/137405/an-october-december-romance", "id": "137405", "author": "TambourineBlossom", "author_url": "https://www.fimfiction.net/user/77873/TambourineBlossom", "tags": ["Luna", "Other"], "text": "> An October-December Romance\r\n>  by TambourineBlossom\r\n> --------------------------------------------------------------------------\r\n\r\n> An October-December Romance\r\n> --------------------------------------------------------------------------\r\n\r\nOne night in late fall, Luna glanced around the festivities held in Ponyville's main square. Though she was technically the guest of honor, some part of her felt empty. She had already thrown spiders tonight, and bobbed for apples, and danced as much as she dared. It was another few hours until her performance as 'Nightmare Moon' would be required to cap off the evening. For now, she spent her time much as she had in her long exile on the moon.\r\n\r\nWell, perhaps not quite. There had not been a punch bowl on the moon. \r\n\r\nShe found herself draining another glass of the delicious concoction. Cherries... definitely some cider... she sighed. Berry Punch would never part with her secret recipe, not even for a princess, not even on her special night. Luna clearly intended to enjoy her annual chance at figuring out the punch's ingredients. Some Nightmare Nights, she could spend upwards of an hour at the bowl, writing down theories to try when she returned to Canterlot.\r\n\r\n\"Nice night, isn't it?\" A slightly hoarse, somewhat worn-down voice snapped Luna out of her private reverie. \"Er, your majesty.\"\r\n\r\n\"Please, withhold the formalities tonight. You may call me Luna.\" She smiled at the elderly stallion who provided the welcome interruption from her own thoughts.\r\n\r\n\"Folks call me Mr. Waddle,\" he answered with a smile of his own. His voice was worn, like the rest of him, but had a hidden strength behind it the years couldn't quite diminish.\r\n\r\n\"And what do your friends call you, Mr. Waddle?\" Luna cocked her head to the side, an eyebrow raised as she attempted to gauge the elderly stallion's intentions.\r\n\r\n\"They used to just call me Waddle.\" He adjusted his clerical collar awkwardly. \"Don't call me much of anything these days, seeing as most of them moved on to Celestia's Garden.\"\r\n\r\nThe death of friends was never a particularly good icebreaker, especially when immortality came into the mix. Luna handled the situation with the grace, dignity and tact expected of a princess of Equestria.\r\n\r\n\"Your collar... are you dressed as a priest for Nightmare Night?\" She gave him a painful grimace; Luna was not especially given to pleasantries on the most mundane of subjects.\r\n\r\n\"Not just for Nightmare Night! I wear it Sundays, Mondays, weddings and funerals too. It was this or the bow tie. Don't get to be my age without taking a good long look at your wardrobe and deciding what matters.\"\r\n\r\nLuna nodded, still trying to figure out the strange old stallion. \"Not that I do not welcome the company, but why have you graced u- me with your presence?\"\r\n\r\n\"Past couple of decades, every time I come to one of these party things I find the oldest pony in the room and strike up a conversation. For obvious reasons... tonight, that's you. I have to say, Luna, you don't look a day over nine hundred.\"\r\n\r\nLuna genuinely smiled for the first time in over an hour, a filly-like giggle escaping her lips before she caught herself. \"Thank you for the compliment... I think.\"\r\n\r\nMayor Mare waved at Luna, gesturing to the moon and holding up a pocket watch.\r\n\r\n\"I am sorry, that's my cue. We should speak again sometime.\"\r\n\r\n\"Sounds fun. Be seeing you, Luna.\"\r\n\r\n\"Mm.\" Luna nodded pleasantly at him. \"I will see you soon... Waddle.\"\r\n\r\n\r\n\r\nIt was a few weeks later, late one beautiful afternoon in Ponyville. Mr. Waddle waited at a table outside one of the town's cafes. He chewed nervously on the stem of his unlit pipe; that doctor had finally convinced him to stop smoking, but having it helped him relax. Besides, though the affectation struck him as coltish and unbecoming of his years, he couldn't imagine parting with the trappings of his special talent.\r\n\r\n\"Another cup of coffee, Mr. Waddle?\" a server approached his table with his face aglow and a tray balanced expertly on his back.\r\n\r\n\"At this hour? I'll never get to sleep.\"\r\n\r\nThe server looked up wordlessly at the sun, still high in the sky, then nodded and began to trot over to another table.\r\n\r\n\"Hold on, I didn't say I didn't want it.\" He held out his cup, the corners of his mouth spreading across his wrinkled face. \"I'm meeting somepony, and she's a bit of an evening pony, you might say.\" He sipped at the thick brew, inky as a moonless night. \"Perfect, thank you.\"\r\n\r\n\"Getting started without me?\" Luna trotted up, smiling.\r\n\r\n\"Not at all. Just grabbing some coffee while I waited for you. Do you want to head out, or...\"\r\n\r\n\"Let's just enjoy the moment.\" Luna gestured for the server, and soon had a cup of coffee and a blueberry scone waiting before her. She levitated half of it over to Waddle, and the pair munched their treats contentedly.\r\n\r\n\"Is that the bow tie you told me about?\" She gestured to Waddle's neck.\r\n\r\n\"Oh, no. I, uh, actually bought this for tonight. I figured it'd be nice to wear something new.\" He blushed nearly as red as his tie.\r\n\r\n\"Well, it looks very nice on you.\"\r\n\r\n\"Oh, uh. Thank you.\"\r\n\r\n\r\n\r\nA few hours later, the two of them sat on a hill in the park, watching the sunset.\r\n\r\n\"Oh! I almost forgot.\" Luna stood up on her hind legs, raising her front legs above her head as the rising moon cast her in silhouette. \"Sorry.\r\n\r\n\"Not a problem... there aren't many ponies any age who've seen a private moonrise.\" He grinned cheekily at Luna.\r\n\r\n\"Oh, hush, you.\" She returned the smile, curling up on the comfortable grass beside him.\r\n\r\n\"You know, when I was a colt, I thought the night sky was enchanting.\" He stared off into the distance, his old eyes straining to make out the stars. \"I wondered why nopony else seemed to love it like I do.\" He turned back to her looking at the moonlight reflected in her eyes. \"A thousand thousand stars, scattered across a sky so blue it's almost black...\" \r\n\r\nLuna still had the decorum to blush. Waddle raised a hoof to her beautiful mane, hesitating before they come into contact. \"May I?\" Luna nodded her assent. His hoof completes its journey, burying itself in the image of the night sky.\r\n\r\nLuna's lips smiled, but it didn't quite reach her eyes. \"I am not sure I can do this. What about your oath of celibacy?\"\r\n\r\n\"Princess, priests haven't taken those oaths in centuries. It's not a... We're just there to help ponies when they're on their way in and out of the world, you know? Make everything feel like it really happened. Five days out of seven, I'm just some coot, but ponies still want a priest at their weddings and such.\"\r\n\r\n\"Oh. Hehe...\" Luna laughed, but it was short lived. \"I have outlived every lover I ever had by over a thousand years.\"\r\n\r\n\"My wife passed over to the Garden thirty years ago.\" Waddle stared off into the distance again, this time focused on things no eyes could see. \"For years, I swore I'd never love again; I thought anything less would sully her memory.\" The old stallion propped himself up on the grass, a somber expression on his wizened features. \"The years became a decade, and then decades... and then I realized that she would never have wanted me to use my memories of her to hurt myself. She wouldn't have wanted me to be alone for the rest of my life for her sake.\"\r\n\r\n\"That is when you started courting again?\"\r\n\r\n\"Well, no.\" He winced awkwardly. \"Truth be told, I haven't had any chances since then. But that's not the point. I wasted a third of my life pining after somepony who was gone forever. I'm sure none of the ponies you've had would have wanted that for you... being frank, I don't want it for you either.\"\r\n\r\nLuna looked at him with wide eyes, threatening tears they never quite seemed ready to deliver on.\r\n\r\n\"Luna?\"\r\n\r\nShe threw herself into his hooves, trusting the blanket of the night to do the task assigned to it even before her time.\r\n\r\n\r\n\r\nCelestia rose before dawn; by definition, this was so, but she was responsible for making certain that dawn was at the same time every day. She accepted a cup of coffee and a doughnut from a passing servant as she made her way to the solarium. Her breakfast was complete before she had ascended the stairs. As she entered the wall-less solarium, she shed her bathrobe and raised the sun, perfectly on time as always.\r\n\r\n\"Where is my sister? She usually waits for me here before retiring for the day.\" Celestia stood on the edge of the balcony, drinking in the first rays of sunlight.\r\n\r\n\"Princess Luna is...\" the royal secretary stammered, looking over various memos and notes that had been left for her in the night. \"Ah, here we are. It seems she had urgent business to attend to in Ponyville, and intends to return to Canterlot before the evening.\"\r\n\r\n\"That is what it says?\"\r\n\r\n\"Close enough; I had to translate it. Deareste royal systr, Sulestia, we write to inform thee of oour intenshuns with regards to-\"\r\n\r\n\"Yes, I quite get the picture. Thank you, Moneypony.\" A hint of a smile crept onto Celestia's muzzle.\r\n\r\n\"Princess?\"\r\n\r\n\"It is nothing. Suffice to say I am very happy for my sister. It has been far too long since she has left on... 'business'.\"\r\n"}]
