[{"title": "The Interdimensional Casino-Café-Arcade-Bar", "url": "https://www.fimfiction.net/story/581646/the-interdimensional-casino-caf-arcade-bar", "id": "581646", "author": "Leaf-Storm", "author_url": "https://www.fimfiction.net/user/756195/Leaf-Storm", "tags": ["Crossover", "Main 6"], "text": "> The Interdimensional Casino-Café-Arcade-Bar\r\n>  by Leaf-Storm\r\n> --------------------------------------------------------------------------\r\n\r\n> Why did Me and my friends sit down and write this\r\n> --------------------------------------------------------------------------\r\n\r\n\r\nThe Interdimensional Casino-Café-Arcade-Bar (yes that is it’s name) was lively to say the least\r\n\r\nFoxy was at the bar, chugging down a bottle of beer and smoking a cigar “yar, bring me some more of your strongest!” he told the bartender drunkenly \r\n\r\nApplejack who was running the bar looked at foxy “Now hold on, that was your 14th bottle and your 20th cigar, you aren’t getting no more.” she told the drunk fox as she took the bottle away from him\r\n\r\n“Oh come on matey, Canari here has had like 20 bottles” He pointed his hook hand to an empty seat like someone was there “And ye be cutting me off at 14!”\r\n\r\nApplejack rolled her eyes not playing into Foxy’s hallucination “There’s no pony else at this bar, it’s just been you and me for the past hour.” \r\n\r\nFoxy however looked over and saw a white and yellow bird animatronic sitting there chugging a beer “ye filthy Canari.” he slightly angered slightly drunk said \r\n\r\n—-----------------------------------------------------------------------------------------------------------------\r\n\r\nMeanwhile….\r\n\r\nAcross the bar/casino/cafe/arcade, Chica was play DDR and moving so fast that some swore she was on something\r\n\r\nBonnie however couldn’t care less he was to busy opening up pokemon Scarlet & Violet - Paldean Fates trying to get a rare card “Come on, come on, come on, aw a meowth.” he groaned putting the cards the next to him and the now empty box of packs next to the very tall tower of empty boxes\r\n\r\nAcross the room from Bonnie in the corner was Fluttershy snorting something off the table hidden by her hooves but anypony or any animatronic that got close would get the stare\r\n\r\nPinkie to put it bluntly was high, bouncing around the room at speeds no one could really track, and every time she hit a table or chair she would drop explosive glitter “Oh it’s not just explosive, it spreads” she told the camera fast as she threw said glitter on it covering the vision with purple and pink smoke \r\n\r\nRarity was too busy on her phone, (Wait phone?) making calls to some ponies for dresses and something else she whispered so no one could hear “Deliver it around the back of my boutique at 5 in three days, don’t get caught.”\r\n\r\nTwilight was trying and failing to calm everything down, trying to catch Pinkie, trying to stop Fluttershy from snorting whatever she was snorting, didn’t really know what Rarity was doing and “IS THAT CELESTIA!!?”\r\n\r\nYes Twilight it is indeed Celestia, she was drunk dancing in the middle of the cafe floor while Luna and Tiberius just watched looking at each other \r\n\r\nA waitress came over “Here are your 40 coffees, your highness, but I must ask why 40?”\r\n\r\n“So I can deal with my sister” Luna bluntly replied \r\n\r\nFreddy Fazbear meanwhile was at the slots “Five more minutes, only five Freddy, you already spent your house, sold your car and kid.” each time he said that he would go over to an atm and get more money to spend on slots, than it happened after over 255,555,000 dollars down the drain he finally won “I did it, I won 30 cents!” he yelled out loud now he was only 255,554,999.30 dollars in debt and also owed another 1,000,000 to the mafia \r\n\r\nApplejack watched as men in suits came in and started beating Freddy in the Fazballs before blindfolding him and taking him away “Told him to just invest in Sweet Apple Acres stock.” She cleaned a bottle and turned to see Celestia “Oh, Your highness, uh what brings you here?”\r\n\r\nLuna walked over “she’s drunk, and I downed 40 cups of coffee, or was it 45?” she was visibly shaking from all the energy she got “Hey who turned out the lights” She than promptly fainted which Tiberius smacked her to wake her up “Tiberius, what was that for?”\r\n\r\nTiberius pointed to Celestia who was drunk asleep\r\n\r\n“Oh, i’ll go get the car” Luna said as she got some keys she totally had in her mane\r\n\r\nBack at the cafe, Pinkie watched as Bonnie was now covered in pokemon packs somehow still having more after opening up over 1000 packs and not getting a single rare card “Come on, Bonnie needs a down payment” he opened it and got another meowth, he then bashed his head onto the table breaking it\r\n\r\nFoxy had come back from the bathroom, (that I totally mentioned earlier) and was still drunk as well a pirate, he went over to the bar “hey, AJ, get me another beer, i’m going to beat Canari here”\r\n\r\n“For the last time, no, and there is no Canar-”\r\n\r\nCanari than sat down “Hey”\r\n\r\n“I-I, what?” AJ said dumfounded \r\n\r\nIn the arcade Rainbow Dash was trying to beat Chica in DDR and failing somehow\r\n\r\n“Oh come on, how does she never miss” RD said frustrated at somehow losing to a chicken that ways a ton but can move like water\r\n\r\nPinkie bounced in on air “Hey Dashie, have you tried this substance I stole from Fluttershy in the corner” in her hoof was a white substance that looked oddly like sugar “All you do is snort it.”\r\n\r\nDash looked at it “and I just inhaled it through my nose?”\r\n\r\nPinkie nodded way to fast her eyes red as blood \r\n\r\nRainbow snorted it and immediately felt the effects and challenged Chica again\r\n\r\n“Better luck next time, blue pony.” Chica said victorious while Dash’s eyes were swirls of dizzy \r\n\r\n\r\n\r\n\r\nRarity watched and rolled her eyes \"Darling, watch this.” she told Dash as she called for Sweetie Bot “Sweetie Bot here challenges you Chicken” she leaned down to Sweetie Bot “You only objective is to win, I have a remote charger if needed” Sweetie Bot nodded\r\n\r\nSweetie Bot and Chica stared before getting on the pads and starting, it went on hours but after a long time, Chica started to slow, running low on battery while Sweetie Bot seemed to only get faster, and Chica admitted defeat \r\n\r\n\r\n\r\nTwilight watched everything from afar groaning, first her teacher was drunk, then her friends all took substances except Applejack, she wondered if there was anything she was missing “I should have never trusted that puppet.”\r\n\r\n"}, {"title": "Vehicular Deerslaughter", "url": "https://www.fimfiction.net/story/581545/vehicular-deerslaughter", "id": "581545", "author": "Wanderjugend", "author_url": "https://www.fimfiction.net/user/629994/Wanderjugend", "tags": ["Gore", "Violence", "Death", "Crossover", "OC", "Chrysalis"], "text": "> Vehicular Deerslaughter\r\n>  by Wanderjugend\r\n> --------------------------------------------------------------------------\r\n\r\n> Doeplough\r\n> --------------------------------------------------------------------------\r\n\r\nHivesmarschall Trimmel was sweating buckets, despite the -5 °C Elksburg air freezing his carapace solid. But you know what's on his mind right now? It ain’t the below freezing temperature, it's the dead deer in his Panzer’s snowplough.\r\n\r\nNormally, this was a non-issue: scrape it off, power-wash the tank, done. But today, Queen Chrysalis herself was inspecting the Olenian front—against every general’s advice—because Trimmel had steam rolled the enemy in weeks. Now, with Her Majesty en-route, the deer had turned from an amusing bauble to a potential career-ender.\r\n\r\nHe’d tried yanking the beast free. Didn't budge with hooves or magic. He’d ordered five Lings to help detach the snowplough itself. Nope, the impact had practically welded it in. And he had given up listening to suggestions when one had suggested using explosive magic to dislodge it, who then proceeded to argue with another Ling who suggested finding a bear to gnaw the deer off. \r\n\r\nIdiots. All of them. \r\n\r\nSo here he stood, in front of his deer-ornamented panzer, wishing he could crawl back into his egg. Perhaps I could blame the deer? Suicidal ideation maybe? Surely she won't court-martial me over glorified road-kill?\r\n\r\n“Panzer Division! Present arms!” Trimmel barked, snapping to attention as Chrysalis’ transport plane screeched onto the runway. His division, having drawn lots to position their tanks as far from their commanding officer as possible, saluted in unison.\r\n\r\nChrysalis stepped off, scowling at the cramped plane that clearly wasn’t built for a queen of her stature. Trimmel quailed, he had been hoping she’d be in a good mood, he had forgotten how much she despised assisted air-travel.\r\n\r\nDieter, her ever-dutiful Guard, swept the perimeter (pointless, with a tank division on guard) and immediately clocked the deer. An eyebrow rose in unamused displeasure, but he returned the division’s salute in the Queen’s Guard style: right forehoof at a crisp 45 degrees. He had introduced that one, Trimmel could not help but wonder where he got the idea for such a strange salute.\r\n\r\n\"I did not know this base had a sign that says 'Dead Deer Storage' Hivesmarschall Trimmel.\" Dieter whispered acidically.\r\n\r\nTrimmel sneered, both keeping the salute. \"How is the rear Ditherer? Still unable to find that traitor Thorax?\"\r\n\r\nChrysalis, done glaring at the plane, surveyed the tank column, as usual either unnoticing or uncaring of her two favoured Lings antipathy. “Hivesmarschall Trimmel,” she purred, “you’re the only Ling in my army who doesn’t botch my every order. Congratulations.”\r\n\r\nTrimmel, decoding her tone as I’m in a foul mood, and you’re the only good news today, bowed. “Just doing my duty, my Queen.”\r\n\r\n“Quite.” Her scowl softened into a smirk. “Now, let’s inspect this backwater, these deer are primitive, but I hear there is an oil refinery—”\r\n\r\nShe froze mid-turn, her eyes locking onto his panzer. Trimmel almost cringed, instead simply keeping his gaze ramrod straight despite the slight tremble that had entered his pupils. “…Trimmel. Is that a deer in your snowplough?”\r\n\r\nHis muzzle scrunched like he’d been kicked in the thorax. “Y-Yes, it is my Queen.”\r\n\r\nChrysalis blinked, slowly, her voice dripping with menace. “Why is there a deer in your snowplough, Hivesmarschall?”\r\n\r\nTrimmel swallowed, eyes darting anywhere but her, unfortunately landing momentarily on a, visibly enjoying this, Dieter. “I-It’s not my fault, my Queen! She ran right in front of my panzer!”\r\n\r\nHer lidded gaze could’ve melted steel. “On the battlefield, I presume?”\r\n\r\n\r\n\r\n\r\n\r\nEarlier.\r\n\r\nTrimmel, as usual, ignored his aide Rhombi’s pleas to stay with the column. Elksburg was a cakewalk now, the closest thing to an enemy army was long crushed beneath his advance. Through his binoculars, he spotted a deer trudging through the snow. Deserter? Straggler? Didn’t matter.\r\n\r\nA fanged grin split his face, and he leaned down to speak to his crew. “Eugen, let me drive.”\r\n\r\nEugen blinked, looking at him strangely for a moment before he noticed the deer through his viewing port. “Hivesmarschall, you’re not—”\r\n\r\n“Are you disobeying an order, Herr Eugen?” Trimmel replied simply.\r\n\r\nEugen sighed, and replaced him in the cupola. \r\n\r\nTrimmel almost caressed the controls, before snapping the accelerator forward, lurching everyling inside but him backwards from the force. The deer’s head snapped up at the accompanying roar, eyes wide with primal panic, as twenty tonnes of steel veered off-road and crunched right into her.\r\n\r\n\r\n\r\n\r\n\r\nTrimmel’s eyes slid back to Chrysalis, trembling. “Ehehe…sorta?”\r\n\r\nRhombi sighed, eyes darting to the mangled corpse while Chrysalis stared down at Trimmel with that same lidded gaze, and Dieter looked vindictively pleased just behind her, he’d always hated Trimmel.\r\n\r\nThen—a snort. A giggle. Chrysalis erupted into laughter, not her usual maniacal cackle but a genuine, sidesplitting howl. Everyling present stared at her with varying degrees of shock. Dieter looked at her as if she was crazy.\r\n\r\n“‘Sorta!’ ‘Sorta!’!” Chrysalis finally managed words again, her laughter dulling to a happy chortle. “Ah. Now thathas made this day slightly better, Hivesmarschall. Perhaps a new medal for you, hm? How about the Order of the Flattened Doe?” She descended back into laughter as Trimmel’s division roared, Trimmel visibly relaxing as he chuckled as well, as much in relief as actual mirth.\r\n\r\n“My Queen, I hate to interrupt, but we have a schedule to keep.” Dieter cut in, looking as if he had swallowed a lemon.\r\n\r\nChrysalis waved him off, still giggling. “Yes, yes, Dieter, I suppose I didn’t pick you for your humour. Come Hivesmarschall. There are things other than mutilated Deer to discuss.”\r\n\r\nTrimmel nodded and fell into step beside her, managing an aside smirk at Dieter—who visibly twitched before following on from behind.\r\n\r\n“Now about the plans for Alicorn Sunset, and don’t even think about running over the Princesses Trimmy—those two are mine.”\r\n\r\nTrimmel nodded sheepishly. \"Of course my Queen. Though I wonder if the Crystal City is Panzer-friendly.\"\r\n\r\nChrysalis snorted again. \"Not those two either. The pink one is also mine. And I admit a lingering fondness for her husband, the unicorn. Save your talents for the battlefield from now on, Trimmy, or I will order you to polish that plough with your tongue.\"\r\n"}, {"title": "Dressed In Dappled Gold", "url": "https://www.fimfiction.net/story/581572/dressed-in-dappled-gold", "id": "581572", "author": "CharmingMarething", "author_url": "https://www.fimfiction.net/user/848677/CharmingMarething", "tags": ["Pinkie", "Rarity"], "text": "> Dressed In Dappled Gold\r\n>  by CharmingMarething\r\n> --------------------------------------------------------------------------\r\n\r\n> Beneath the Tree\r\n> --------------------------------------------------------------------------\r\n\r\n\"I've never been to this part of the park before.\"\r\n\r\nRarity's keen eye scrutinized a dark pine boldly looming over the faded pathway. It was the sort of tree a pony might see in the Everfree, not Ponyville; an obelisk of phthalo pigment marring the unassuming, verdant palette of calm slopes and birches.\r\n\r\n\"We're kinda-sorta not in the park anymore!\" Pinkie's enthusiastic voice floated to Rarity from beyond the pine's broad frame.\r\n\r\n\"So where exactly are you taking me?\" The inquiry was a futile one and Rarity knew it — she'd been attempting to ascertain their true destination for the better part of half an hour with no success. A pony didn't get far in the world of fashion without being stubborn, though.\r\n\r\nRarity turned the corner. Pinkie's roseate coat clashed garishly against a backdrop of fern, moss, and sage. Offending all good sense without a lick of self-consciousness, Pinkie hopped across a lush carpet of grass — the sorry path they'd been following had abruptly come to an end. \"We're almost there!\"\r\n\r\nImpatience and suspicion sat heavily in Rarity's gut alongside an over-large lunch. Why had Pinkie insisted on treating her to so much food, anyway? She hadn't even allowed Rarity to order her usual sunflower seed salad, demanding the unicorn indulge in something more decadent. Her recommendation had been delicious, yes, but Rarity wasn't used to eating so much; her lunches typically amounted to spot of light snacking while she was working on a project.\r\n\r\nRarity gazed up at the sky and dreamed of fabrics as soft as the clouds, of pale turquoise dye and the rumble of her sewing machine. A day spent with a good friend was never unpleasant nor wasted, but she wished Pinkie's idea for how to spend said day had ended with lunchtime.\r\n\r\n\"Pinkie, I know that I promised we'd do whatever it is you wanted today, but wasn't that us going out for lunch? I feel as if doing a second thing goes a bit beyond the exact parameters of our verbal contract.\"\r\n\r\nPinkie Pie paused long enough to tilt her head, looking at Rarity sideways. \"Eating a super yummy lunch was an important part of the thing I wanna do, but not the actual thing! Besides, I'm the one who paid for our food, so that doesn't really count as paying me back, does it?\"\r\n\r\nCurse earth ponies and their simple logic. Rarity dared to hope one last time. \"And what exactly is the thing you want to do?\"\r\n\r\nPinkie resumed her ceaseless march. \"You'll see! We're super-duper close!\"\r\n\r\nWith a groan, Rarity dutifully followed. She was a mare of her word, even if integrity meant going on a long walk across town with a too-full stomach and missing out on time that could be spent on work. Granted, she'd have much more work waiting for her at home if Pinkie hadn't helped her out the other day.\r\n\r\nReminding herself what all of this was for, Rarity steeled her resolve, determined to maintain her composure. She refused to complain or make a show of her own displeasure! A promise was a promise and Rarity had said they could do whatever it is Pinkie wanted. If that amounted to giving Rarity a run around town, so be it!\r\n\r\nProgressing past another large pine, Pinkie Pie lead them well beyond the park's invisible borders. The ground began to slope downward, and Rarity saw a very large tree residing at the base of the little hill, one very much unlike those they'd passed. It was tall with open branches splitting into hundreds more branches, each ending in a burst of emerald leafage. A short distance from the tree was a small pond with tall grasses and reeds outlining its shores. Just looking at it made Rarity's tail instinctively flick against her flank at the thought of gnats.\r\n\r\nPinkie hastily descended the hillside, leading a reluctant Rarity to the base of the tree. \"Yay, we're here!\" The pony hopped in a little circle, then beamed at Rarity.\r\n\r\n\"It's... a tree?\" Rarity could admit it was a rather impressive specimen, but... \"You just wanted to show me a tree?\"\r\n\r\n\"It's not about the tree, silly! It's about what we do under the tree!\"\r\n\r\n\"And what do we do under the tree?\"\r\n\r\n\"This!\"\r\n\r\nPinkie then flopped down into the grass. With an exaggerated stretch of all four limbs, she grinned and began to roll around. \"C'mon!\"\r\n\r\nRarity immediately took a step back. \"What? Pinkie, no! You want me to... to roll around on the ground? Like a barbaric little filly without a spot of good manners? I'm going to get dirty! I'll get icky, itchy grass stains all over my coat and mess up my mane and—\"\r\n\r\nPinkie twisted around to sit up a little, bright blue eyes catching Rarity's. \"You promised to try whatever I wanted to do today!\"\r\n\r\n\"I...\" Rarity's smile was a wobbly, placating thing. \"Yes, yes, darling, I know. And I do so appreciate all the help you gave me the other day finishing up that shipment of gowns. I truly couldn't have done it without you. It's just that—\"\r\n\r\n\"You promised.\"\r\n\r\n\"...What if I go get a— a blanket, perhaps? Something I could lie on?\"\r\n\r\nPinkie Pie pursed her lips and furrowed her brow as if considering it. Rarity's ears perked up, hopeful.\r\n\r\nBut Pinkie just sighed and said, \"It's not the same, though.\"\r\n\r\nHer dampened demeanor cut through to Rarity, who's lids fluttered as she regarded her friend with freshly attentive eyes. Then Pinkie sullenly added, \"You don't have to roll around... Just lie down with me. Please?\"\r\n\r\nHonestly, how cruel would a pony have to be to say no to that? Rarity accepted defeat with as much grace as possible... which meant she only whined for a second before telling Pinkie, \"Fine.\"\r\n\r\nPinkie's grin shone brightly in spite of the great tree's umbra. The earth pony rolled onto her back and eagerly waved carnation hooves into the air. \"Come on! Come on!\"\r\n\r\nWith all the enthusiasm of Opal at the vet's office, Rarity eased herself down onto her fours. The grass was soft, but her skin immediately crawled at the thought of dirt and tiny, hidden insects touching her.\r\n\r\n\"So are we just... lying here?\" Rarity peered upward. The midday sun was at just the right angle to peer down at them through a thick awning of foliage, and Rarity was briefly dazzled. She turned away, blinking spots of vermilion from her eyes.\r\n\r\nWhen Rarity's vision cleared, her friend was lying in a sprawl on her back, all four limbs akimbo. \"Yeppers!\"\r\n\r\nRarity cast a furtive glance across the open swath of nature surrounding them, but there was nopony else in sight. Only the birds and bugs might judge Pinkie for her outlandish behavior, and Fluttershy was the only pony who might care for their opinion.\r\n\r\nThey spent the next few moments in silence — much to Rarity's surprise. For a while, there was only the sound of rustling greenery and the quiet lapping of water just within earshot. Once Rarity got past the uncomfortable feeling of lying on bare earth, she found it was almost... peaceful.\r\n\r\nHer position wasn't the best, however. As she was, she was putting a bit of weight on her full stomach. The desire to readjust grew until eventually Rarity couldn't resist the urge any longer. The unicorn eased herself onto her side a bit. She let her hind legs relax, keeping herself propped up with her forehooves tucked beneath her.\r\n\r\nA breeze made the branches overhead sway, and spots of sunlight danced in the grass. On the tail of that wind was the smell of sedge and iris; it grazed their coats and ruffled Rarity's mane. She tossed her head to readjust her heavy curls only to find the gesture evolved into a spontaneous stretch. Rarity let out a faint groan as her muscles went taught, then eased into a satisfying release of tension.\r\n\r\nUnnoticed beside her, Pinkie Pie's smile grew.\r\n\r\nRarity had fallen out of her dainty pose but found she didn't mind it. Spread out as she was, she could feel more grass warmed by steady sunlight. It was a comfort to her body, weary from their long walk and heavy with good food. The mare slowly began to melt. A final tether snapped as she allowed her neck to bow. Rarity rested her head upon the ground, cheek pillowed by purple bangs.\r\n\r\n\"Oh.\" Closing her eyes, Rarity took a slow, deep breath. \"This is actually quite nice...\"\r\n\r\nShe heard Pinkie shuffle around. The smell of sprinkles joined that of waterlilies. \"Do you really think so? I love this spot! It's so nice for napping!\"\r\n\r\nAnother shuffle. Sugary curls tickled Rarity's nose. Peeking through her lashes revealed a view dominated by Pinkie's mane.\r\n\r\nPinkie's voice was quiet when she said, \"Sometimes, I just like to come here and sit for a while. To relax, you know?\"\r\n\r\nFor Pinkie Pie, her tone was rather subdued. But still, she sounded happy. Pinkie was a pony whose smile you could hear. Rarity felt herself mirror the sentiment. Pulling herself forward just a bit, Rarity was able to rest her chin atop Pinkie's withers. From this angle, she could just make out her friend's round, rosette cheeks.\r\n\r\nRarity's smile grew. \"Thank you for sharing this place with me, Pinkie.\"\r\n\r\nPinkie hummed, resting her head in the grass and closing her eyes. Dappled gold shone across her coat — always swaying, never still. Flecks of gold in rosy quartz. Rarity thought the effect was quite fetching.\r\n\r\nLetting out a lazy sigh, feeling the warm touch of sunlight, Rarity closed her eyes again and let herself enjoy the moment.\r\n"}]
