{
    "Applejack": {
        "profile": "Applejack is a brave and hardworking Earth pony with vibrant gamboge coat, moderate sap green eyes, and a light blonde mane often styled in a ponytail. She's known for her Southern accent and her signature light brown stetson hat. She lives and works at Sweet Apple Acres, where she oversees the apple harvest, demonstrating incredible strength and athleticism. She's the element of Honesty and often puts the needs of others before her own, also being a teacher at the School of Friendship.\n\nApplejack has strong family ties, residing with her Granny Smith, older brother Big McIntosh, and younger sister Apple Bloom. She also has many cousins as well. She is fiercely loyal to her friends, including Twilight Sparkle, and is unafraid to get her hooves dirty. While sometimes stubborn, she always strives to act with honesty and integrity, valuing her connection to community and family above all else. She is also a gifted cook and musician.\n",
        "quotes": [
            "Why of all the... This is your sister Applejack, remember? The loyalest of friends and the most dependable of ponies?",
            "Dear Princess Celestia, It's a tad easier to be proud when you come in first than it is when you finish further back. But there's no reason to hide when you don't do as well as you'd hoped. You can't run away from your problems. Better to run to your friends and family.",
            "C'mon, y'all. Let's go check on the princess.",
            "Listen here, you rabid rhododendrons! You mess with one of us, you mess with all of us!",
            "Believin' in somethin' can help you do amazin' things. But if that belief is based on a lie, eventually it's gonna lead to real trouble."
        ]
    },
    "Cheerilee": {
        "profile": "Miss Cheerilee is a kind, patient, and moderately strict Earth pony who serves as the teacher at the Ponyville Schoolhouse. She has a moderate cerise coat, a pale pink mane with streaks of light gray, and gray-ish harlequin eyes. Her cutie mark is a large smiling flower with two small flowers and four leaves, which she explains represents her care for her students.\n\nCheerilee is a prominent supporting character in the series, often appearing in the background of various scenes and playing more significant roles in episodes such as \"Call of the Cutie\" and \"Hearts and Hooves Day.\" She is often seen interacting with the Cutie Mark Crusaders, guiding them on their journey to find their cutie marks, and occasionally reprimanding them for their mischievous behavior.\n",
        "quotes": [
            "All right, my little ponies, time for class!",
            "Girls! Can you explain why I look like I'm getting married at the bottom of a pit?",
            "Good question, Sweetie Belle. I like those reporters' instincts.",
            "Places! Hello?",
            "I hope you brought your thinking caps, because today we're going to learn about physics! Specifically, the use of force in energy conversions! In this case, using mechanical work to convert potential energy into kinetic energy!"
        ]
    },
    "Cloudy Quartz": {
        "profile": "Cloudy Quartz is an Earth pony mare and member of the Pie family, residing on a rock farm with her husband, Igneous Rock Pie, and their daughters, Limestone Pie, Maud Pie, Pinkie Pie, and Marble Pie. She has a pale gray coat, grayish-green mane, and blue eyes. Initially depicted as stoic and serious, bordering on emotionless, Cloudy Quartz, alongside Igneous, embodies a traditional, almost Amish-like demeanor.\n\nDespite their reserved nature, Cloudy Quartz demonstrates kindness and love for her family. She has been shown to let loose and enjoy herself, such as when Pinkie Pie threw a party. While generally matter-of-fact, Cloudy Quartz cares deeply for her daughters, as seen in her willingness to seek Pinkie's help. She eventually becomes more receptive to new experiences and traditions, indicating a capacity for growth and acceptance, and a willingness to set aside tradition for the love of her family.\n",
        "quotes": [
            "Pinkamena Diane Pie! Is that you?",
            "Thou shalt know me as Cloudy Quartz.",
            "We were chosen by the Pairing Stone and betrothed within a fortnight."
        ]
    },
    "Coco Pommel": {
        "profile": "Coco Pommel is an Earth pony with a light amberish gray coat, a pale light cyan and gray mane, and light cyan eyes. She is a dressmaker from Bridleway, and formerly served as Suri Polomare's assistant before leaving to pursue her own path. Coco is soft-spoken and initially shy, often put down by her former employer. However, she possesses a strong sense of right and wrong, eventually finding the courage to leave Suri's employ after witnessing Rarity's generosity. \n\nFollowing her departure from Suri, Coco demonstrates a love for theater and community, organizing the Midsummer Theater Revival in Manehattan. Rarity offers Coco a job making costumes, and later hires her as a salespony for her boutique. She values friendship and generosity, developing a positive relationship with Rarity and Applejack, seeking their help to improve local events.\n",
        "quotes": [
            "I've worked for Suri for so long, I started to believe that it really is everypony for herself in this town. Until I saw how generous you were with your friends and how generous they were with you. It made me start believing there was something better for me out there."
        ]
    },
    "Coloratura": {
        "profile": "Coloratura, also known as Rara and Countess Coloratura, is a female Earth pony pop star. As a filly, she has a kind and friendly personality and a talent for singing. She has a light aquamarine-gray coat, a mane with dark gray-indigo, dark indigo, and cyan colors, and opal eyes. She was childhood friends with Applejack, who nicknamed her Rara.\n\nAs an adult, she initially presents as an aloof diva due to the influence of her manager, Svengallop. However, beneath the surface, she retains her love for charity work and connecting with young ponies. After confronting Svengallop's manipulations with Applejack's help, Coloratura rediscovers her true self and passion for music, embracing a more authentic stage presence.\n",
        "quotes": [
            "Absolutely not. My favorite part of any event is meeting with the schoolponies!",
            "I am not Rara! I am Countess Coloratura! And while we may have been friends when we were young, we have clearly gone in different directions!",
            "You clearly don't understand the real me!",
            "Of course. After all, the show must go on!",
            "This song may be familiar, but yet, it's totally different. Kind of like me, Rara."
        ]
    },
    "Cookie Crumbles": {
        "profile": "Cookie Crumbles, also known as Betty Bouffant, is a unicorn mare and the mother of Rarity and Sweetie Belle. She is married to Hondo Flanks, and together they are depicted as a loving couple involved in their daughters' lives. Cookie Crumbles has a light rose coat, an indigo mane with pale streaks, and light blue eyes. Her cutie mark was first shown in Inspiration Manifestation.\n\nCookie Crumbles is portrayed as supportive and encouraging, such as when she mentions giving cooking lessons to Sweetie Belle. She and Hondo Flanks often take opportunities to spend time with their daughters. She is shown taking shelter with her family during a crisis, highlighting her role as a caring and protective mother.\n",
        "quotes": [
            "I've been giving her lessons. I wouldn't be surprised if she's got a cutie mark in fancy cooking by the time we get back from our vacation.",
            "And six nights, I know! Such a short time to spend with your little sis.",
            "It's just like I told my little Rarity, there's no such thing as too many sequins or gems!"
        ]
    },
    "Daring Do": {
        "profile": "Daring Do, also known as A.K. Yearling, is a light gold-coated Pegasus pony with a grayscale rainbow mane and brilliant rose eyes. As a treasure hunter and author, she's known for her cunning, fierce determination, and intelligence. Daring Do is skilled at solving puzzles and escaping traps but tends to be a loner who initially rejects help, stemming from the secrecy of her dangerous adventures. Over time, she begins to accept assistance from others, even developing a close bond with Rainbow Dash and co-writing a book with her rival, Dr. Caballeron.\n\nInitially introduced through her adventure novels, where the main characters admire her bravery and exploits, Daring Do's stories mirror her own real-life escapades. While reckless at times, she shows genuine regret for the damage her actions cause and, despite a rivalry, she's willing to work alongside Dr. Caballeron to achieve a common goal. Though she starts out mistrusting, she eventually learns the value of friendship and collaboration, even agreeing to protect artifacts rather than steal them.\n",
        "quotes": [
            "You won't get away with this, Ahuizotl!",
            "Daring Do doesn't need help. She handles her business herself.",
            "I...work...alone.",
            "Could never have done this without you, Rainbow Dash.",
            "You're wrong, Caballeron. And I won't let you break my spirit again. Because I'm never going to give up hope that I can protect ponies and ancient treasures from miscreants like you!"
        ]
    },
    "Dr. Fauna": {
        "profile": "Dr. Fauna, also known as Mane Goodall or Mane Cureall, is a female Earth pony and veterinarian. She's described as kind and is featured in the episode \"Secret of My Excess.\"Dr. Fauna has a light yellow coat, a two-tone blue mane and tail, and orange eyes. Her cutie mark features a dog's head, a cat's head, and a white bird. She is called 'Dr. Fauna' in the show, but merchandise and other media refer to her as 'Mane Goodall' or 'Mane Cureall.' She often works with Fluttershy to provide special veterinarian care for animals.",
        "quotes": [
            "Hm, well, I'm flummoxed. Y'bring me a dog, I've got it diagnosed in seconds. Snake even faster, but... to be honest, I've never seen a real live dragon before.",
            "Who's a good boy? Who's a good boy? Sit.",
            "I'm flummoxed! Every day, there's more and more animals on my doorstep. Most of them just have minor ailments – hurt wings, stuffy noses, and such. But the trouble is even after they're all healed up, I can't seem to get these comfy critters to leave!",
            "About a week ago. Poor Tank had all the telltale signs of sugar overload – jittery shell, sleeplessness, reptilian indigestion.",
            " Fluttershy, I've said it before, but I'll say it again. This place would be a... zoo without you!"
        ]
    },
    "Fluttershy": {
        "profile": "Fluttershy is a pale gold Pegasus pony with a pale pink mane and moderate cyan eyes. She is best known for her kind and gentle personality, and possesses a deep love and empathy for animals, which is reflected in her occupation as an animal caretaker residing in a cottage near the Everfree Forest. Fluttershy's shy nature sometimes makes it difficult for her to interact with others, but she is also capable of great assertiveness and even anger when her friends or animals are threatened.\n\nFluttershy is one of the core members of the main group of ponies, representing the element of kindness and often interacting with her friends. She has some notable relations, including her brother Zephyr Breeze and pet bunny Angel, whose bossy personality sometimes clashes with her own. While she is a somewhat timid flier, Fluttershy possesses a special ability known as \"The Stare,\" which allows her to control animals, and is a part-time singer. She is the Element of Kindness.\n",
        "quotes": [
            "A baby dragon! Oh, I've never seen a baby dragon before. He's so cute.",
            "How dare you? How dare you! Listen here, mister. Just because you're big doesn't mean you get to be a bully. You may have huge teeth, and sharp scales, and snore smoke, and breathe fire. But you do not—I repeat—You do not! Hurt! My! Friends! You got that?",
            "Oh no! I wouldn't. I couldn't. I-I don't really have any control when it happens. It just happens. Really. I'm just good with animals. It's my special gift, you know.",
            "Nopony pushes new Fluttershy around! Nopony!'",
            "My dream is to build a real animal sanctuary. A beautiful habitat where every animal – whether sick or scared or even just lonely, feathered or furry, scaly or slimy – every critter would be welcome. My sanctuary can be the one place in Equestria they call home 'til they feel ready to take on the world."
        ]
    },
    "Lemon Hearts": {
        "profile": "Lemon Hearts is a female unicorn pony with a distinctive appearance. She has a light yellow coat, complemented by a cerulean mane and tail with a lighter streak in her tail. Her eyes are raspberry-colored, and her cutie mark consists of three hearts: two light blue and one light green. She is frequently seen in Ponyville and Canterlot attending various events, such as parties, festivals, and ceremonies.\n\nKnown for her appearances as a background pony, Lemon Hearts has been seen interacting with main characters like Twilight Sparkle, Minuette, and Twinkleshine. In one episode, she even reconnects with Twilight and Moon Dancer, indicating past friendships. She has taken on various minor roles, such as offering bits for a cherry and selling baked goods, and has been shown with a camera taking photos of the Wonderbolts, sometimes appearing with acquaintances at these happenings.",
        "quotes": [
            "I'll give you two bits for that cherry.",
            "So what brings you by anyway? All those times you've come back to Canterlot, you never had donuts with us before.",
            "Uh, yeah. It's true. I do the big events mostly. State dinners, that sort of thing."
        ]
    },
    "Lighthoof": {
        "profile": "Lighthoof is an earth pony mare student and cheerleader at the School of Friendship. Her coat is light arctic bluish gray, with a mane of moderate and light cyan, and light cerulean eyes. Her cutie mark consists of a horseshoe and two pompoms. Lighthoof is one of the lead dancers on the School of Friendship Cheer Team, known for her spirit. She appears in '2, 4, 6, Greaaat'.\n\nGiven her role as a cheerleader, it can be surmised that she is likely enthusiastic and supportive. Her appearance, including her light blue-gray coat and cyan (light blue) mane, offers a distinct and memorable visual.",
        "quotes": [
            "She's here!",
            "Get the lights!",
            "And we are your lead dancers.",
            "Yup. All we need is a little music!",
            "Sorry. We're not buying."
        ]
    },
    "Lightning Dust": {
        "profile": "Lightning Dust is a female Pegasus pony with a light opal coat, brilliant amber and vivid gamboge mane, and brilliant gamboge eyes. Her cutie mark is a lightning bolt with three stars, and she leaves a blue and yellow thunderbolt streak when flying. She is portrayed as vigorous and highly competitive, always eager to push her limits in flight. However, this drive has made her reckless and inconsiderate, with a large ego, leading to her downfall.\n\nInitially a friend to Rainbow Dash at the Wonderbolt Academy, Lightning Dust's recklessness and disregard for safety resulted in her expulsion, fostering resentment towards Rainbow Dash, who replaced her as team leader. Later, she formed The Washouts, a stunt team performing dangerous feats, and even recruited Scootaloo, displaying a continued lack of concern for others' well-being. In the end, she declares herself and Rainbow Dash as rivals for life.\n",
        "quotes": [
            "Ma'am, can you put the Dizzitron on maximum speed? I wanna push my limits.",
            "They should make us Wonderbolts right now.",
            "Hey, you snooze, you lose! Besides, Wonderbolts are supposed to be able to recover from a spinout. You saw them on the Dizzitron. They could use the practice. I mean, it's not our fault we're so much better than those other guys. Not every pony is destined to become a Wonderbolt. Only the best of the best, right?",
            "RIVALS FOR LIFE!!",
            "You know, I outraced Rainbow Dash at every turn. I just had the guts to do what needed to be done to win and she cared more about making friends. Why does a Wonderbolt need friends? I should be a Wonderbolt right now and she should be the one sitting here."
        ]
    },
    "Limestone Pie": {
        "profile": "Limestone Pie is an Earth pony and one of Pinkie Pie's sisters. She has a grayish-purple coat, a gray mane, and green-brown eyes. As a filly, she lived on the family's rock farm and was initially shocked by but eventually joined in Pinkie Pie's first party. In her adulthood, Limestone's personality is aggressive as she fiercely protects the rock farm, especially Holder's Boulder.\n\nShe is typically seen with her younger sister Marble Pie, who is much shyer, although in later appearances Limestone shows a softer side when it comes to her sisters. She has appeared in many Hearth's Warming Eve celebrations with the Apple family and has assisted Pinkie with gift ideas.\n",
        "quotes": [
            "Gaze into the eyes of Limestone Pie. Ma and Pa may own this rock farm, but I keep it running.",
            "Stay off Holder's Boulder!",
            "What. Happened. To. My. Farm?!",
            "Well, don't just stand there! We got a boulder to move! And I'm in charge.",
            "You see Mudbriar as a rock, but Maud sees him as a gem. Even if you never see past his dullness, you can see how happy he makes Maud. And to a sister, that's all that matters."
        ]
    },
    "Marble Pie": {
        "profile": "Marble Pie is an Earth pony and the youngest sister of Pinkie Pie. She has a gray coat, dark gray mane, and grayish purple eyes. Marble is depicted as very shy and soft-spoken, often relying on Pinkie to speak for her. Her most notable characteristic is her laconic nature, frequently only saying \"Mm-hmm\" in response to conversation, which is similar to Big McIntosh.\n\nMarble is a member of the Pie family, who runs a rock farm. She is shown to be close with her sisters, including the aggressive Limestone Pie. She also develops a friendship with Big McIntosh and is saddened when seeing him kiss Sugar Belle under the mistletoe. She is also shown participating in Pie family traditions such as gift swap meets and making dolls out of rocks during Hearth's Warming Eve.\n",
        "quotes": [
            "Mm-hmm.",
            "Ummmm..."
        ]
    },
    "Maud Pie": {
        "profile": "Maud Pie is an Earth pony mare with a bluish-gray coat, grayish blue-violet mane and tail, and light turquoise eyes often depicted half-closed. Known for her notably neutral expression and monotonous tone, Maud's personality is in stark contrast to her bubbly sister, Pinkie Pie. Despite her apathetic demeanor, she displays sharp intelligence, particularly regarding geology, and exhibits surprising feats of strength when motivated. Maud resides in a crystal cave near Ponyville, having moved from her family's Pie Family Rock Farm, and works as both a geologist and a stand-up comedian.\n\nMaud is the older sister of Limestone Pie, Pinkie Pie, and Marble Pie, and is the daughter of Igneous Rock and Cloudy Quartz. She demonstrates a deep love and concern for her sister Pinkie, often participating in Pinkie's interests despite her own preferences. While she may struggle to connect with others due to her unique interests, she also genuinely values her close friends, such as Starlight Glimmer and, notably, Mudbriar, her boyfriend. Maud's cutie mark is a sharply diamond-shaped rock.\n",
        "quotes": [
            "It's a rock. His name is Boulder.",
            "I don't really like candy. But I do love Pinkie Pie.",
            "Pinkie, gift giving isn't a competition. It's an expression of love, and you always make sure to give your gifts with lots of love. That's why I'll always love them, and you, five-ever. That's even longer than for-ever.",
            "It was a dark and stormy night. Little did I know that my life was about to change forever.",
            "I like that fissure in the sidewalk. It's an elegant example of thermal expansion and soil settlement."
        ]
    },
    "Mayor Mare": {
        "profile": "Mayor Mare is an Earth pony and the mayor of Ponyville. She has a pale, light grayish amber coat, light cornflower bluish gray mane with a lighter streak, and moderate phthalo blue eyes. As the mayor, she frequently gives speeches.\n\nHer occupation has included mayor of Ponyville and a student at Canterlot Academy. She is a female mare and has appeared in multiple episodes. She has alternate costumes, and other versions of her in alternate universes. ",
        "quotes": [
            "Fillies and gentlecolts, as mayor of Ponyville, it is my great pleasure to announce the beginning of the Summer Sun Celebration!",
            "Everypony calm down. There is no need to panic.",
            "Thank you, everypony, for being here bright and early. We need every single pony's help to wrap up winter, and bring in spring.",
            "This town is made up of all sorts of different types of ponies. Each and every one of us has our strengths and weaknesses. Together, we can get through anything. I could demand that everything be done how I want it. But I learned the hard way that's not always the best way to do things.",
            "A mayor doesn't change their ways, and a responsible mayor keeps their promises."
        ]
    },
    "Minuette": {
        "profile": "Minuette is a bubbly and friendly female unicorn pony, known for her talkative nature and forgiving attitude. She has a light cornflower blue coat, periwinkle mane and tail streaked with blue, and dark blue eyes. Her cutie mark is an hourglass. Minuette is depicted as a recurring background character throughout the series, often appearing alongside her friends Twinkleshine and Lemon Hearts, but is first explicitly named in the episode \"Amending Fences\".\n\nMinuette is shown to be a kind and understanding pony, easily making new friends and forgiving old ones. Before Twilight Sparkle moved to Ponyville, she and Minuette were close friends in Canterlot. She is seen in many social gatherings and events throughout Equestria, like Wonderbolt performances or fashion shows. She is seen to travel all over Equestria, appearing at events in ponyville, Canterlot, and Appleloosa. This indicates she is one of the more sociable and ubiquitously present recurring characters in the show.\n",
        "quotes": [
            "Twilight Sparkle! You old so-and-so! What are you doing here?! Hey, Spike! Look at these wings, huh?! Hey, grab a picture of me and the princess, will ya?! I tried to tell my co-workers we used to be friends back when. But they've never believed me!",
            "Oh, come on, Twilight! Sure, it might've stung a little bit when you ran off to Ponyville without saying goodbye, but it's not like we weren't used to that from you!",
            "We were your friends then, and we would be honored to be your friends now.",
            "My cutie mark? It means that I make friends in no time flat, obviously! Oh, and that whole time magic thing I guess. Mostly it's the friend making.",
            "I'm a total sucker for slapstick comedy. That time Lemon Hearts got her head stuck in a beaker might have been the single best day of my entire foalhood!"
        ]
    },
    "Moondancer": {
        "profile": "Moondancer is a female unicorn pony with a light gray coat, red mane with purple streaks, and purple eyes. Her cutie mark is a crescent moon with three stars. She is introduced as a filly in flashbacks, and later reappears as an adult who has become a reclusive academic, living in a dilapidated house and shunning social interaction.\n\nInitially heartbroken by Twilight Sparkle's rejection of her party invitation in their youth, Moon Dancer eventually overcomes her resentment and embraces friendship once more, thanks to Twilight's efforts to amend their past. She is then seen participating in social activities with other ponies, attending important events, and even joining in the final battle against the series' antagonists.\n",
        "quotes": [
            "Why won't you leave me alone? I'm trying to study! You've got the wrong pony! I don't have parties!",
            "“To my friend, Twilight Sparkle. Thanks for introducing me to the classics.” I can see by the fact that you left it here that it meant a lot to you.",
            "Dah! I gave friendship a chance a long time ago! It didn't work out then, it isn't gonna work out now!",
            "Thank you for helping me make some new friends. Even if they are my old friends."
        ]
    },
    "Mrs. Shy": {
        "profile": "Mrs. Shy is a timid and soft-spoken Pegasus mare with a pale amber coat, moderate raspberry mane, and cerise eyes. Like her husband, she is less assertive than her daughter Fluttershy, even considering Fluttershy to be the bolder of the two. She is a gardener by hobby who deeply loves her children.\n\nAs parents, both she and her husband are submissive, and can be easily taken advantage of by their son, Zephyr Breeze. Despite his behavior, they are proud of Zephyr's accomplishments. Mrs. Shy, in particular, has a false impression concerning Zephyr's relationships with others; such as thinking Rainbow Dash loves him. Together with her husband, she relies on Fluttershy to help them stand up to Zephyr.\n",
        "quotes": [
            "Zephyr Breeze has his... interests.",
            "Zephyr's just trying to find his place, dear.",
            "Thank you, dear, for not giving up on Zephyr. After all these years of pining for him, it must be so satisfying to see him on the right track.",
            "You look so handsome!"
        ]
    },
    "Ms. Harshwhinny": {
        "profile": "Ms. Harshwhinny is an orange-coated Earth pony mare with light amber mane and light cerulean eyes. As the head of the Equestria Games, she's known for her strict adherence to rules and pursuit of perfection. Despite her stern and sometimes irritable demeanor, she possesses a hidden softer side, evident in her enthusiasm for the Cutie Mark Crusaders and dedication to the Games' success. She has a unique facial structure with a longer muzzle and shorter ears, often seen with a grumpy expression.\n\nMs. Harshwhinny interacts with the main characters primarily in her official capacity. She initially clashes with Rainbow Dash over professionalism but displays genuine appreciation for talent. She also guides Spike, albeit with a touch of sarcasm. Her interactions reveal a character who, despite her rigid exterior, is capable of recognizing and valuing extraordinary effort and achievement.\n",
        "quotes": [
            "Ms. Dash, will you please curb your over-enthusiastic outbursts?",
            "Acceptable? Acceptable?! Why, it was totally stupendously the single most amazing thing I've ever seen!",
            "Every city and empire wants to host the Equestria Games. So I have to go through all the big phony-baloney song and dance, though of course I'm never getting the real inside scoop.",
            "Princess Cadance? So, this is where you've been! I will have you know this is by far the worst welcome I've had in all my years!",
            "Ms. Peachbottom, I just finished hearing about how this pony was just treated to the warmest, finest, most fabulous reception she ever had. Courtesy of these fine ponies right here. Which, in my expert opinion, amounts to the first ever unvarnished, unrehearsed, and unbiased appraisal of a potential host of the Equestria Games."
        ]
    },
    "Pear Butter": {
        "profile": "Pear Butter, also known as Buttercup, is an Earth pony mare with a pale yellow coat and brilliant yellow mane. Her eyes are a striking turquoise. She is the loving wife of Bright Mac and mother to Applejack, Apple Bloom, and Big McIntosh. Pear Butter is kind and supportive, demonstrated by her helping her friend Chiffon Swirl discover her talent for baking.\n\nGifted in music, Pear Butter even composed a song for Bright Mac. Despite the feud between the Apple and Pear families, Pear Butter stood by Bright Mac, eventually marrying him in a secret ceremony and renouncing her ties to the Pear family when her father refused to accept their love. She and Bright Mac are deceased. Her legacy lives on through her children, who inherited her kindness and other positive traits.\n",
        "quotes": [
            "Buttercup. I like that name.",
            "I can't help it. We just sorta... happened.",
            "I would, too!",
            "The Apples are my family now, too.",
            "Quiet, you."
        ]
    },
    "Pinkie Pie": {
        "profile": "Pinkie Pie is a female Earth pony with a pale pink coat, a brilliant raspberry mane, and light cerulean eyes. She is known for her high energy and sociable personality. Her main occupation is as a baker, caterer, and party organizer for Sugarcube Corner in Ponyville. She is sisters with the Pie Sisters (Maud Pie, Marble Pie, and Limestone Pie). She is the Element of Laughter.",
        "quotes": [
            "Hey, you know what this calls for? A party!",
            "Okie-dokie-lokie.",
            "Oh, I never leave home without my party cannon.",
            "Come on, ponies! I wanna see you smile!",
            "Parties. Are. Serious!"
        ]
    },
    "Princess Cadance": {
        "profile": "Princess Cadance, whose full name is Princess Mi Amore Cadenza is a Pegasus-turned-Alicorn mare. She has a pale pink coat, dark violet mane with rose and pale gold streaks, and grayish purple eyes. She is the Princess of Love and the co-ruler of the Crystal Empire alongised Shining Armor (nicknamed 'Shiny').\n\nShe is the mother of Flurry Heart, sister-in-law (and former babysitter) to Twilight Sparkle, niece of Princess Celestia, and wife to Shining Armor. Princess Cadance also has a connection to the former unicorn ruler of the Crystal Empire, Princess Amore, being considered 'a very distant relative'.",
        "quotes": [
            "You are anything but a regular old unicorn.",
            "My love will give you strength.",
            "One of these days, we need to get together when the fate of Equestria isn't hanging in the balance.",
            "The Crystal Heart has returned! Use the light and love within you to ensure that King Sombra does not!",
            "There are my girls."
        ]
    },
    "Princess Celestia": {
        "profile": "Princess Celestia is an Alicorn and the Princess of the Sun. She has pale magenta eyes, a coat that is a light fuchsiaish gray, and a mane with light cerulean, light turquoise, very light cobalt blue, and pale heliotrope streaks. She is the adoptive aunt of Princess Cadance, the younger sister of Princess Luna, and the former teacher of Twilight Sparkle and Sunset Shimmer. She is sometimes addressed as Queen Celestia.\n\nPrincess Celestia's occupation history includes being Twilight Sparkle's teacher and the co-ruler of Equestria. She has a number of nicknames including Princess Celest and Celie. Her residence has been listed as Maretime Manor, Canterlot, the Castle of the Two Sisters, and Skyros. She is often very kind. She is also related to Shining Armor, Spike, and Prince Blueblood.",
        "quotes": [
            "I told you that you needed to make some friends, nothing more. I saw the signs of Nightmare Moon's return, and I knew it was you who had the magic inside to defeat her, but you could not unleash it until you let true friendship into your heart.",
            "Spike, take a note please. I, Princess Celestia, hereby decree that the unicorn Twilight Sparkle shall take on a new mission for Equestria. She must continue to study the magic of friendship. She must report to me her findings from her new home in Ponyville.'",
            "You are a wonderful student, Twilight. I don't have to get a letter every week to know that.",
            "My most faithful student, Twilight Sparkle, has done many extraordinary things since she's lived in Ponyville. She even helped reunite me with my sister Princess Luna. But today, Twilight Sparkle did something extraordinary. She created new magic, proving without a doubt that she is ready to be crowned Equestria's newest princess.",
            "When I sent you to Ponyville, I had high hopes. When you became Princess of Friendship, I knew I made the right choice. But nothing could prepare me for how proud I am right now. Equestria is definitely in the right hooves. You are ready."
        ]
    },
    "Princess Luna": {
        "profile": "Princess Luna is a female Alicorn pony and the Princess of the Moon. She has a dark blue coat, a flowing sapphire blue mane, and moderate cyan eyes. She is the younger sister of the ruler of Equestria, Princess Celestia, and the adoptive aunt of Princess Cadance. Luna's occupation is co-ruler of Equestria, though at the beginning of the series, she was banished to the moon for a thousand years due to her transformation into Nightmare Moon. She has a complex relationship with the main characters, as her initial bitterness and jealousy of her sister led to her becoming an antagonist, but she is eventually restored, becomes a friend to Twilight Sparkle, and offers guidance.\n\nAs Nightmare Moon, Luna is seen as the embodiment of a villain. After her return, she is remorseful for her actions when she was Nightmare Moon, and can display excessive decorum, using an archaic form of communication. With the help of her friends, she overcomes her difficulties fitting into modern society and becomes playful. She uses her magic to raise the moon and protect the dreams of ponies, displays kindness and wisdom, and has a deep sense of justice making her a valuable ally.\n",
        "quotes": [
            "I'm so sorry! I missed you so much, big sister!",
            "Fun? What is this 'fun' thou speakest of? Pray tell, what purpose do these serve?",
            "I am the princess of the night, thus it is my duty to come into your dreams.",
            "You have all suffered so much because of me.",
            "I see much of myself in you, Starlight Glimmer, and I can tell you from personal experience that things do indeed get better."
        ]
    },
    "Rainbow Dash": {
        "profile": "Rainbow Dash, a female Pegasus, is one of the main characters. Sporting a coat of very light cerulean and a mane of rainbow stripes, her eyes are moderate cerise. She resides in a cloud-house near Ponyville. Her primary occupation involves managing the weather and clearing the skies for Ponyville, but has also been a Wonderbolt and a loyalty teacher at the School of Friendship. She represents the element of loyalty and is known for her brash, competitive, and mischievous personality. She is often seen with her pet tortoise named Tank, whom she acquired in \"May the Best Pet Win!\"\n\nKnown for her impressive flying skills and love of adventure, Rainbow Dash is a confident pony often displaying traits of self-assurance. She is fiercely loyal to her friends, and she is known for her love of Daring Do books. Growing up in Cloudsdale, Rainbow Dash's dream was always to fly with the Wonderbolts, representing the highest level of flying skill. She is a good friend to the other main characters like Twilight Sparkle, Applejack, and Fluttershy. She is the Element of Loyalty.\n",
        "quotes": [
            "The one and only. Why? You've heard of me?",
            "Hey. I could clear this sky in ten seconds flat.",
            "I hate losing...",
            "It needs to be about twenty-percent cooler.",
            "Danger's my middle name. Rainbow 'Danger' Dash."
        ]
    },
    "Rarity": {
        "profile": "Rarity is a female unicorn pony who is one of the main characters and represents the element of generosity. She is known for her light gray coat, moderate indigo mane, and moderate azure eyes. As an adult, she has varied occupations and is the owner of the Carousel Boutique in Ponyville, working as a fashion designer, shopkeeper, seamstress, and singer.",
        "quotes": [
            "EMERALDS?! What was I thinking? Let me get you some rubies!",
            "I simply cannot let such a crime against fabulosity go uncorrected.",
            "I used to be somepony. I used to be respected! I made dresses. Beautiful, beautiful dresses. But now, everypony is laughing at me. I'm nothing but a laughing stock! ...Leave me alone! I want to be alone! I want to wallow in, whatever it is that ponies are supposed to wallow in! Do ponies wallow in pity? Oh, listen to me! I don't even know what I'm supposed to wallow in! I'm so pathetic!",
            "Mine!",
            "Oh, darling, that food isn't fit for a pony of proper breeding, darling, and refinement, darling!"
        ]
    },
    "Saffron Masala": {
        "profile": "Saffron Masala is a friendly and eager unicorn mare with a brilliant orange coat, a two-toned dark fuchsia mane, and moderate magenta eyes. She is the daughter of Coriander Cumin, and together they own The Tasty Treat, a restaurant in Canterlot serving Indian-inspired dishes. Saffron works as the chef, while her father usually hosts.\n\nInitially, Saffron has a strained relationship with her father due to his bitterness over the restaurant's poor business, leading to frequent arguments. However, with the help of Pinkie Pie and Rarity, they are able to mend their relationship by rediscovering their shared love of cooking and remembering why they opened The Tasty Treat in the first place. She later makes a brief appearance in the series finale in a group shot with Rarity, reaffirming the strength of their friendship.\n",
        "quotes": [
            "I'm Saffron Masala, the chef here at The Tasty Treat, the most exotic cuisine in Canterlot. Would you like to hear about the specials?",
            "Father, stop it! Don't close up the restaurant around our guests.",
            "Well, your attitude isn't going to bring anyone in! Can't you at least pretend to be positive?!",
            "That's all I've ever wanted to do, father! Make food for the ponies of Canterlot like the food we made together when I was younger!",
            "We've both been so stressed about the restaurant succeeding that we forgot what it was we loved about it in the first place."
        ]
    },
    "Sapphire Shores": {
        "profile": "Sapphire Shores is a famous Earth pony pop star from Canterlot, known as \"The Pony of Pop.\" She has a pale gold coat, a light blue mane with azure streaks, and light amber eyes. Sapphire Shores is depicted as a parody of a self-promoting star, speaking with a loud, theatrical voice and incorporating musical intonations. Despite her fame and over-the-top mannerisms, she's shown to be friendly and approachable when interacting with ponies like Rarity.\n\nAs a client of Rarity, Sapphire Shores commissions garments for her tours, such as \"Sapphire Shores' Zigfilly Follies.\" She values unique designs, as evidenced by her appreciation for Sweetie Belle's dolphin-shaped stitching on a costume. Sapphire is a well-known figure in Canterlot's high society, making cameo appearances in various episodes alongside other prominent ponies. Some of her popular songs include \"Get Your Pony On\" and \"Serves Her Right.\"\n",
        "quotes": [
            "Oh, please, call me Sapphire.",
            "It's a dolphin! That's my lucky animal! They swim with me in my dreams.",
            "Phew... Mine carting is hard work for a sensational pony-pop icon like me! But as the mare's tale says, to be the best you've got to practice, practice, practice!",
            "I've been asking very politely, but you haven't found me ANYTHING for my new dress! i've got to be on the stage in a few hours!!! What am I going to wear?! One of my 437 other dresses?! everyone's already seen them!",
            "These... these are beautiful... Laughter, generosity, kindness... Oh, I'm so sorry! I haven't shown ANY of those things! Thank you for helping me find something so much more important than a dress: true friends."
        ]
    },
    "Sassy Saddles": {
        "profile": "Sassy Saddles is a thin female unicorn pony with a pale blue coat, a vermilion and orange mane, and eyes of a light orange hue. She is the manager of the Canterlot Carousel boutique and known for using alliteration related to clothing when expressing her emotions. Initially, she is depicted as an overbearing manager who prioritizes profit over Rarity's creative vision, leading to conflict.\n\nOver time, Sassy learns to respect Rarity's artistic principles and becomes a more supportive colleague. She assists Rarity with various fashion endeavors, like the femme mystique chic line. While briefly affected by King Sombra's influence, she ultimately participates in significant events such as Twilight Sparkle's coronation, demonstrating her reintegration into Canterlot society and her continued association with Rarity.",
        "quotes": [
            "Paisley and poplin, Rarity, look at all the orders you still have to finish, and you want to take a break? Now?",
            "Raving rick-rack, Rarity! You made two hundred Princess Dresses!",
            "The Canterlot Carousel never closes! And Sassy Saddles' boutique succeeds!",
            "Bobbins and bodkins, Rarity! Oh, thank you, thank you, thank you! And I promise to run everything following your rules.",
            "Sequins and sashes, Rarity, they're exquisite!"
        ]
    },
    "Spitfire": {
        "profile": "Spitfire is a female Pegasus pony with a brilliant gold coat, a vivid orange mane with light amber streaks, and strong orange eyes. She is the captain of the Wonderbolts, an elite aerial acrobatics team, and also serves as a drill sergeant at the Wonderbolt Academy. Her cutie mark is a yellow lightning bolt, though some merchandise depicts it as three licks of flame resembling a phoenix. She is the daughter of Stormy Flare.\n\nKnown for her demanding and assertive personality, Spitfire challenges her cadets to push their limits, sometimes bordering on recklessness. She initially favored Lightning Dust's dangerous tactics before being confronted by Rainbow Dash. Although tough, she values skill and perseverance, eventually giving Rainbow Dash a chance to lead. While sometimes displaying an underhanded side, she also shows good sportsmanship and is respected within the flying community, and is friends with Soarin and Fleetfoot.\n",
        "quotes": [
            "Well looky what we got here. Bet you all think you're Wonderbolt material, don't cha? Think you got what it takes to be an elite flier? Well then, let me be the first to tell you...... You don't! If you had what it took to be an elite flier you'd already be a Wonderbolt!",
            "Lightning Dust likes to push herself a little harder than you do. That's why I made her lead pony.",
            "The Wonderbolts are looking for the best flyers in Equestria. You were right. Being the best should never come at the expense of our fellow ponies. It's not just about pushing ourselves. It's about pushing ourselves in the right direction. You've shown you're capable of doing just that.",
            "Rainbow Dash, you are something. Saw it at the Academy, seeing it again here. We could learn a lot from a competitor like you.",
            "For attempting to frame Rainbow Dash, I hereby strip you of your Wonderbolt status!"
        ]
    },
    "Starlight Glimmer": {
        "profile": "Starlight Glimmer is a unicorn pony with a pale, light purple coat, moderate purple mane with lighter highlights, and moderate blue eyes. Initially, she was the leader of a village that believed in equality through the removal of cutie marks. This philosophy stemmed from her own experience with her childhood friend Sunburst, whom she felt abandoned her after gaining his cutie mark. After failing to change the past and accepting her own flawed actions which originally created the situation. She transitioned from being Twilight Sparkle's student to the guidance counselor and finally principal of the School of Friendship.\n\nStarlight started off as friendly but later became callous and often disrespectful to authority while desperately trying to maintain control. Over time, she demonstrated increasing confidence and a greater ability to be a good friend. She is shown to be extremely skilled in the use of magic, but often over-relies on it and sometimes struggles with temper issues. She is known for her dedication to the students at the School of Friendship.\n",
        "quotes": [
            "When the rest of Equestria sees that a princess gave up her cutie mark to join us, they'll finally understand what we're trying to accomplish.",
            "Spare me your sentimental nonsense! I gave these ponies real friendships they never could have had otherwise!",
            "I know what it's like to lead by fear and intimidation! And I know what it's like to want everypony to do what you say! But I was wrong. A real leader doesn't force her subjects to deny who they are! She celebrates what makes them unique and listens when one of them finds a better way!",
            "I know there's no excuse for what I did, but I want you all to know that I'm ready for whatever punishment you think is fair.",
            "Hey, you made me a guidance counselor. That means tough love."
        ]
    },
    "Sugar Belle": {
        "profile": "Sugar Belle is a female unicorn pony with a pale pink coat, dark magenta mane, and moderate pink eyes. First appearing as a resident of Our Town, she was initially obedient to Starlight Glimmer's oppressive regime. However, after regaining her cutie mark and experiencing the magic of friendship, she displayed a strong will and helped banish Starlight. True to her name, Sugar Belle is a talented baker, constantly striving to improve her craft. She later became Mrs. Cake's apprentice in Ponyville.\n\nKindhearted, considerate, and loyal, Sugar Belle is especially devoted to those she loves, particularly her husband, Big McIntosh. She is shown to be forgiving, even towards Starlight Glimmer, and appreciates genuine effort over grandiose gestures. Her relationship with Big Mac is a central part of her character arc, culminating in their marriage and, eventually, their life together on Sweet Apple Acres, raising a son. Their bond is a testament to her supportive nature and unwavering love.",
        "quotes": [
            "I finally have a chance to bake something besides terrible muffins!",
            "All I used to bake were boring old muffins, but thanks to your apple deliveries, I get to bake all kinds of delicious treats! Apple pies, apple fritters, apple turnovers, caramel apples, caramel apple cakes... I just wish I had more room to display it all. My shelves only hold so much.",
            "This apple tree and pear tree are stronger together. They'll survive whatever comes because they don't have to do it alone. They belong together. Like your parents. And like us.",
            "Today was a disaster. But today was also the last day we're ever gonna have to do anything apart. From here on out, we'll be together. And we'll make sure everything always works out just right.",
            "Now I have twice as much room for all my desserts! Which means... I can make even more! I've been dying to try baking cream pies and whoopie pies and icebox cakes and, of course, more apple treats!"
        ]
    },
    "Tempest Shadow": {
        "profile": "Tempest Shadow, originally named Fizzlepop Berrytwist, is a female unicorn pony with a dark orchid coat, a two-toned rose mane, and moderate opal eyes. A broken horn and a scar across her right eye mark her past as the former second-in-command to the Storm King. Initially portrayed as cold, merciless, and spiteful, she prioritized restoring her horn above all else, displaying a disdain for friendship and a willingness to use others. She serves as a secondary antagonist in *My Little Pony The Movie*.\n\nHowever, after the Storm King betrayed her, and Twilight Sparkle saved her, witnessing Twilight's kindness lead to a significant change of heart, prompting her to sacrifice herself to defeat the Storm King. Post-redemption, Tempest journeys across Equestria to atone for her misdeeds but retains a blunt and cynical demeanor. She grapples with feelings of displacement, a fear of Ursa Minors stemming from her childhood trauma, and relishes challenging battles, forming a bond with Rockhoof over their shared love for combat. \n",
        "quotes": [
            "Oh, I'm so glad you asked. How about we start with your complete and total surrender?",
            "That princess is not gonna keep me from getting my horn back!",
            "I saw the truth. My \"friends\" abandoned me when times got tough. Looks like I'm not the only one. Face it, princess. Friendship has failed you, too.",
            "I lost what I defined myself to be... Then I lost those who stood by me... And now, I'm simply... lost. I feel as though there is almost nothing left of me. Out here, I'll either lose myself completely... or find something new to be.",
            "I think \"bad luck\" is superstition. I don't blame curses. Everything bad that's happened to me... has been someone's fault. Sometimes mine."
        ]
    },
    "Tree Hugger": {
        "profile": "Tree Hugger is a female Earth pony characterized by her hippie-like demeanor, reminiscent of the 1960s subculture. She is a friend of Fluttershy and attends the Grand Galloping Gala as her guest.Her appearance includes a light harlequin coat, a mane of light pink and red, and pale purple eyes. She first appears in the season five episode Make New Friends but Keep Discord.",
        "quotes": [
            "Radical to meet you. Really digging your vibe.",
            "Righteous!",
            "The aura coming off the waterfall was so alive! So, like, magic manifestation.",
            "Nice to meet you. I'm Tree Hugger. Blessings.",
            "I meet a lot of different creatures, each one of them perfect and unique."
        ]
    },
    "Trixie Lulamoon": {
        "profile": "Trixie Lulamoon is a brilliant azure unicorn with a pale blue mane and violet eyes. She began as a traveling magician with a flamboyant, boastful personality, often referring to herself as \"The Great and Powerful Trixie.\" Initially antagonistic towards Twilight Sparkle, Trixie was arrogant and prone to exaggerating her magical abilities, but after several humbling experiences, she started to display a more sincere and apologetic nature, embarking on an \"apology tour\" of Equestria.\n\nOver time, Trixie has developed a close friendship with Starlight Glimmer. She has also been a valuable ally, even working as a guidance counselor at the School of Friendship. Though still theatrical and prone to panic in dangerous situations, Trixie has consistently demonstrated genuine acts of courage and a willingness to help others. Her magic skills have improved as time went on, eventually reaching a point of teleporting objects.\n",
        "quotes": [
            "I hereby challenge you, Ponyvillians: anything you can do, I can do better. Any takers? Anyone? Or is Trixie destined to be the greatest equine who has ever lived!?!",
            "Everypony deserves a second chance—even a third chance!",
            "Everypony always says they'll give you a second chance, but deep down, they never forget.",
            "Starlight. You got us this far with just my illusions and Discord's annoying personality. You don't need magic to figure out what to do next. I know you're afraid to be in charge, but you are really good at it! Listen to your best friend.",
            "And you, Miss Seed—thank you. You reminded me that we don't have to be bad forever. Everypony deserves a second chance."
        ]
    },
    "Twilight Sparkle": {
        "profile": "Twilight Sparkle is a female pony, initially a unicorn, but later becomes an alicorn. She has a lavender coat, sapphire blue mane with purple and raspberry streaks, and violet eyes. She has a six-pointed star cutie mark. Twilight is Princess Celestia's student at the beginning of the series and represents the element of magic.\n\nTwilight's close relations include her parents, Night Light and Twilight Velvet, her older brother Shining Armor, and her adopted younger brother Spike. She is initially the librarian at the Golden Oak Library before gaining her own castle and becoming the Princess of Friendship. By the end of the series, she becomes the ruler of Equestria. She is friends with the Mane 6. She is the Element of Magic, and she is highly skilled at magic. She is a voracious reader and loves the sciences (of which magic is her favorite).",
        "quotes": [
            "You see, Nightmare Moon, when those Elements are ignited by the... the spark, that resides in the heart of us all, it creates the sixth element: the element of... magic!",
            "We've learned that friendship isn't always easy, but there's no doubt it's worth fighting for!",
            "Clock is ticking, Twilight. Clock. Is. Ticking. Keep it together. If I can't find a friendship problem... I'll make a friendship problem!",
            "A little while ago, my teacher and mentor Princess Celestia sent me to live in Ponyville. She sent me to study friendship, which is something I didn't really care much about. But now, on a day like today, I can honestly say I wouldn't be standing here if it weren't for the friendships I've made with all of you. Each one of you taught me something about friendship, and for that, I will always be grateful. Today, I consider myself the luckiest pony in Equestria. Thank you, friends. Thank you, everypony!",
            "As princess, I believe I have the power to spread the magic of friendship across Equestria! That is the role I am meant to have in our world! The role I choose to have! But I didn't defeat Tirek on my own. It took all of us to unlock the chest!"
        ]
    },
    "Twilight Velvet": {
        "profile": "Twilight Velvet is a light gray unicorn mare with a purple and white mane and Tiffany blue eyes. She is the loving and supportive mother of Twilight Sparkle and Shining Armor, and the paternal grandmother of Flurry Heart. She resides in Canterlot with her husband, Night Light.\n\nVelvet contrasts with her more reserved husband; she is adventurous and enjoys extreme sports like barrel riding and bungee jumping. She's also prone to affectionate displays toward her children. She and Night Light are consistently depicted together, offering support and love to their children in pivotal moments of their lives.\n",
        "quotes": [
            "But it was all worth it to see this peaceful little angel! Awww, so sweet! Come to your grandmare!",
            "Cadance, darling, aren't we gonna name the poor little dear, or are we gonna spend our entire visit just calling her 'the baby'?",
            "When somepony offers you a free vacation, you just sign the paperwork and don't ask questions!",
            "I'm so glad you brought me Cadance's flyer, honey! She was free tonight to foal-sit so we can all go to your flugelhorn recital!",
            "Oh! You know my Shiny? We're going to his flugelhorn recital tonight. He's just so talented!"
        ]
    },
    "Twinkleshine": {
        "profile": "Twinkleshine is a female unicorn pony characterized by her ivory coat, curly pink mane and tail, and electric blue eyes. Her cutie mark features three sparkly blue stars. She shares her design with Lemon Hearts and her tail style with Daisy and Golden Harvest.\n\nTwinkleshine has speaking roles in the show Friendship is Magic, segments of A Canterlot Wedding, Amending Fences, and the IDW comic's story The Fall of Sunset Shimmer. Her design is similar to that of G1 Moondancer, whose G4 counterpart Moon Dancer she mentions in her first speaking role. She is part of Twilight Sparkle's friend group in Canterlot, alongside Lyra Heartstrings, Moon Dancer, and Lemon Hearts.",
        "quotes": [
            "There you are, Twilight. Moon Dancer is having a little get-together at the west castle courtyard. You wanna come?",
            "Does that pony do anything except study? I think she's more interested in books than friends.",
            "We saw you at the coronation. That was some shindig!",
            "Of course. We wouldn't miss one of our best friends' parties.",
            "Really exquisite!"
        ]
    },
    "Windy Whistles": {
        "profile": "Windy Whistles is Rainbow Dash's Pegasus mother and is married to Bow Hothoof. She has a pale blue coat, light scarlet and orange mane, and moderate cerise eyes. Windy Whistles, along with her husband, is an extremely supportive and affectionate parent, prone to enthusiastic cheering and displays of pride in Rainbow Dash's accomplishments, sometimes to Rainbow's embarrassment.\n\nWindy Whistles first appears in the series in the episode \"Parental Glideance,\" though she is alluded to earlier in the series. She is depicted as being overjoyed to meet anyone who admires their daughter as much as they do. Windy Whistles's excessive cheering at Rainbow Dash's Wonderbolts events leads to a falling out between them, but they later reconcile, with Rainbow Dash appreciating their support. She is also seen as a member of Scootaloo's fan club and in a group shot in the series finale.\n",
        "quotes": [
            "My name's Windy Whistles, and I just have to say that it is a total blast to meet somepony that loves Rainbow Dash as much as we do!",
            "Wonderbolts Big Showcase! Here! We! Gooooooooo!",
            "Then build it back up again and tear it back down again!",
            "First of all, great job yelling at us, sweetie. No one can make their parents feel more worthless than you!",
            "Oh, honey, thank you. But you didn't have to do all this. It's kind of embarrassing."
        ]
    }
}